Config/Reports/ВедомостьОстатковМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ВедомостьОстатковМатериалов</Name>
			<Comment>Ведомость остатков материалов</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДоступнаРасшифровкаСтандартнымиОтчетами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Config/Enums/ТипыСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бухгалтерский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоговый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Управленческий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вспомогательный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/ChartsOfAccounts/ЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfAccounts>
		<Properties>
			<Name>ЕПСБУ</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользоватьВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КОСГУДт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КОСГУКт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезДетализацииКОСГУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляКазенных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляБюджетных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляАвтономных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьНеУказыватьПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоКПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоКЭК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>НалоговыйУчетНеУчитываемых</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>НалоговыйУчетЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>НалоговыйУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Суммовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

Config/Reports/ВедомостьОстатковМатериалов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ДляВызоваИзДругихПодсистем

Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	
КонецПроцедуры

Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт

ИзмененнаяСхемаКомпоновки = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ИзмененнаяСхемаКомпоновки.Параметры, "Счет") Тогда
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ИзмененнаяСхемаКомпоновки.Параметры.Счет, "ПараметрыРедактирования") Тогда
			
			ЭлементыРедактирования = ИзмененнаяСхемаКомпоновки.Параметры.Счет.ПараметрыРедактирования.Элементы;
			ПараметрыВыбораСчета = ЭлементыРедактирования.Найти(Новый ПараметрКомпоновкиДанных("ПараметрыВыбора"));
			Если ПараметрыВыбораСчета <> Неопределено Тогда
				Если Не ПараметрыВыбораСчета.Значение.Количество() Тогда
					
					ВыборкаСчетов = ПолучитьВыборкуСчетов();
					Если ВыборкаСчетов.Количество() Тогда
						
						СписокСчетов = Новый СписокЗначений;
						Пока ВыборкаСчетов.Следующий() Цикл
							СписокСчетов.Добавить(ВыборкаСчетов.Ссылка);
						КонецЦикла;
						
						НовыйПараметр = ПараметрыВыбораСчета.Значение.Добавить();
						НовыйПараметр.Имя = "ОграниченияСписокСчетов";
						НовыйПараметр.Значение = СписокСчетов;
						ПараметрыВыбораСчета.Использование = Истина;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		
		ЭлементыОтбораИФО = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(НовыеНастройкиКД.Отбор, "ИФО");
		Для Каждого ЭлементОтбора Из ЭлементыОтбораИФО Цикл

			НовыеНастройкиКД.Отбор.Элементы.Удалить(ЭлементОтбора);
			
			ЭлементПользовательскихНастроек = НовыеПользовательскиеНастройкиКД.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
			Если ЭлементПользовательскихНастроек <> Неопределено Тогда
				НовыеПользовательскиеНастройкиКД.Элементы.Удалить(ЭлементПользовательскихНастроек);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;

ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, ИзмененнаяСхемаКомпоновки, КлючСхемы);

КонецПроцедуры

Функция ПолучитьВыборкуСчетов()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконтоЦМО
	|		ПО ЕПСБУ.Ссылка = ЕПСБУВидыСубконтоЦМО.Ссылка
	|			И (ЕПСБУВидыСубконтоЦМО.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконтоНоменклатура
	|		ПО ЕПСБУ.Ссылка = ЕПСБУВидыСубконтоНоменклатура.Ссылка
	|			И (ЕПСБУВидыСубконтоНоменклатура.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура))
	|ГДЕ
	|	ЕПСБУ.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)
	|	И ВЫБОР
	|			КОГДА ЕПСБУ.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ЕПСБУ.ДатаОкончанияДействия >= &ТекущаяДата
	|			КОГДА ЕПСБУ.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ЕПСБУ.ДатаНачалаДействия <= &ТекущаяДата
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрДатаОтчета = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаОтчета"));
	Если ПараметрДатаОтчета <> Неопределено Тогда
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(
			"ГраницаОтчета", Новый Граница(КонецДня(ПараметрДатаОтчета.Значение), ВидГраницы.Включая));
	КонецЕсли;
	
	ВыводитьЗаголовок = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьЗаголовок"));
	
	Если ВыводитьЗаголовок <> Неопределено И ВыводитьЗаголовок.Значение Тогда
		
		ПараметрСчет = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Счет"));
		
		Если ПараметрСчет <> Неопределено И ПараметрДатаОтчета <> Неопределено Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ОбщиеОбластиСтандартногоОтчета");
			ОбластьЗаголовок        = Макет.ПолучитьОбласть("ОбластьЗаголовок");
			ОбластьЗаголовок.Параметры.Заполнить(
				Новый Структура("ЗаголовокОтчета", ПолучитьТекстЗаголовка(ПараметрСчет.Значение, КонецДня(ПараметрДатаОтчета.Значение))));
			ДокументРезультат.Вывести(ОбластьЗаголовок);
			ДокументРезультат.Область("R1:R" + ДокументРезультат.ВысотаТаблицы).Имя = "Заголовок";
		КонецЕсли;
		
	КонецЕсли;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ПроцессорВывода.ЗакончитьВывод();
		
	ВыводитьПодписи = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьПодписи"));
	
	Если ВыводитьПодписи <> Неопределено И ВыводитьПодписи.Значение Тогда
		СтандартныеОтчеты.ВывестиПодвалОтчета(Неопределено, ДокументРезультат);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстЗаголовка(Счет, ДатаОтчета)
	
	ТекстЗаголовка = СтрШаблон(НСтр("ru = 'Ведомость остатков материалов на %1'"), Формат(ДатаОтчета,"ДФ=dd.MM.yyyy; ДЛФ=D"));
	
	Если ЗначениеЗаполнено(Счет) Тогда
		РеквизитыСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Счет, "Код,Наименование");
		НаименованиеСчета = СтрШаблон(НСтр("ru = 'по %1 - %2'"), РеквизитыСчета.Код, РеквизитыСчета.Наименование);
		ТекстЗаголовка = ТекстЗаголовка + Символы.ПС + НаименованиеСчета;
	КонецЕсли;
	
	Возврат ТекстЗаголовка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
